"""
1. найдите индекс любого элемнта в каждом списке
2. отсортируйте оба списка
3. посчитайте сколько раз 4 встречается в первом списке
4. удалите эллемент под индексом -5 из первого списка, занесите его в переменную, добавте его во второй список под индексом 5
5. сделайте вложенный список под индексом 6
6. обратитесь к 4 элесенту вложенного списка
"""

x = 1234
i1 = [1, 2, 3, 5, 6, 4, 12, 4, 7, 9, 10, 66, 75, 8, x]
s = "nothing bad"
i2 = ["kiss", "my", s, "metal", "ass", "learn", "this", "by", "heart"]

